app/controllers/home_controller.rb

  def index
    targets = Target.all
---
SELECT * FROM "targets"