app/controllers/target_controller.rb

DELETE FROM "targets" WHERE 1=1
---
  def create
    target = Target.new params[:target]
    clean(target)
    Target.delete_all