app/controllers/target_controller.rb

INSERT INTO "targets" ("created_at", "theta", "updated_at", "lng", "phi", "psi", "lat") VALUES('2009-12-11 10:53:16', 0.0, '2009-12-11 10:53:16', -71.08768, 0.0, 0.0, 42.360799)
---
  def create
    target = Target.new params[:target]
    clean(target)
    target.save!

SELECT * FROM "targets"
---
  def index
    @targets = Target.all

DELETE FROM "targets" WHERE 1=1
---
  def clear
    Target.delete_all